{
  "632": ". ",
  "38622077": "Terms of Use",
  "45138264": "YES! We are currently hiring for this role",
  "46145892": "We also have a special division dedicated to cleaning boats and airplanes.",
  "76980911": "Office Hours: ",
  "-49ccef69": "We Clean...",
  "17cb283e": "Cars & 4x4s",
  "1fef3f": "Cars",
  "-6a2bc3ec": "Trucks",
  "-12c62930": "Heavy Transport",
  "106dca8a": "Transports",
  "6c3f0eae": "Auckland-wide Service",
  "3f2ead7d": "We Come to You!",
  "-4b53ce8b": "0800 447 666",
  "e16c09a": "09 527 7730",
  "7f2746de": "Contact Us",
  "2268ff": "Home",
  "560f747e": "Services",
  "3d503d2b": "No items found.",
  "7260da17": "Other Vehicles",
  "765983c3": "Airplanes & Helicopters",
  "3d5ff13": "Boats",
  "3d8fb0e": "Buses",
  "14fbbbf6": "Cars, 4x4's, & SUVs",
  "5d3ebadd": "Commercial Vehicles",
  "28fad4ff": "Construction Equipment",
  "c09c1be": "Mining Equipment",
  "-486d4037": "Motor Homes",
  "1aef1692": "Specialised Trucks",
  "-2b68423": "Taxis, Limosines & Ubers",
  "60849c11": "about us",
  "-64104400": "Contact",
  "7b33fa08": "Residential car valet",
  "66d7fef7": "We Come to Your Home or Office!",
  "103ed031": "We clean your personal cars at your home or office, so that you don't have to travel anywhere.",
  "-5246aa4b": "Just let us know where and when, and you will have a beautifully clean car when you return. ",
  "-3791d4a0": "Our vans and expert cleaners are fully equipped for any cleaning job.",
  "-5b377405": "Reviews",
  "5f0bd0fc": "Click on the review to see the full text, or ",
  "-31d0a3b1": "see all reviews",
  "2e": ".",
  "645efc51": "About Us",
  "40409a5": "We pride ourselves in world class service... nothing less than the highest quality vehicle washing and detailing expertise in Auckland.",
  "62de878a": "Our services cover the full range of private vehicles, commercial fleets, and heavy machinery, including cars, trucks, boats, airplanes, and heavy machinery.",
  "46a32461": "We pride ourselves in delivering exceptional service for value.",
  "-52aefc2f": "Learn more",
  "-1df83b8d": "Contacts",
  "3137a5e2": "Email Us",
  "217bfee6": "Facebook",
  "4b4aa0be": "25B Norman Spencer Drive",
  "-31207dfe": "Papatoetoe",
  "1335f55c": "Auckland 2104",
  "-6412ef36": "Connect",
  "-273fe2f4": "Information",
  "-3fbde6f6": "Privacy Policy",
  "-33504ea1": "First Name:",
  "-6eb65efb": "Last Name:",
  "-429208f6": "Email Address:",
  "5a0ea5a1": "Thank you! Your submission has been received!",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "f97ecf4": "Copyright 2014 - 2023,",
  "6af0aac6": "The Truck Cleaning Company",
  "-c1e9364": ".\n      ",
  "505d93bc": "All Rights Reserved.",
  "-1af4327c": "Website by ",
  "-6b842d28": "Sygnal",
  "f7e521f": "Contactless Cleaning during ",
  "7f72b47": "COVID-19 Level 3",
  "25eb3": " - ",
  "b119e30": "Click to learn more.",
  "-687c1ec": "Call Now",
  "-4febd617": "Client Testimonials",
  "33eced64": "What our clients think...",
  "de60d6e": "Here's what our clients love about The Car Cleaning Company",
  "-174f21f3": "( click on any testimonial to read the full text )",
  "4b931825": "Special Services",
  "5b921ae8": "We offer a full range of specialised services.",
  "-5e5cfb4c": "SPECIAL DETAILING SERVICES",
  "-67160c7d": "Paint Overspray Removal",
  "5bd9d438": ", including Acrylic, Water-based, Enamel, Rust kill, Teflon, and Bodywax (imported new vehicles)",
  "-214b5d79": "Roadworks Overspray Removal",
  "2696f0f7": ", including Tar, Bitumen, Emulsion, Lime, and Concrete.",
  "5ceba976": "Construction Overspray Removal",
  "2715e7fa": ", including wet concrete, dry concrete, welding fallout, iron filings, plaster spray, grease, oil",
  "2a8d21be": "Decal & Signwriting Removal",
  "4394d92e": ", including glue removal, decals removal, sign writing removal, sticker removal, window tints removal",
  "74c82094": "Graffiti Removal",
  "c292d5e": "Damage Repair",
  "3b8a0e2d": ", including light scratches, bumper scuffs, shopping trolley marks, car wash scratches (car washes using brushes), graffiti, finger printing dust (stolen vehicles)",
  "4c0c10ab": "Water / Flood Damage",
  "fb4344b": ", includes full carpet removal, cleaning, and re-installation.",
  "-45e143a9": "Mould Removal",
  "56c92efc": ", includes full shampoo and treatment to kill mould spores.",
  "-6c11814e": "CLEANING FOR REGULATED VEHICLE USE",
  "6802e7d8": "Food Grade Sanitising",
  "-452f7ec6": "Healthcare Vehicle Sanitising.",
  "-5ede4995": "  Humans have accidents, we sort it out.",
  "-30e18666": "Learn more about our services.",
  "1a1e6840": "MANAGED SITES & PROGRAMME MAINTENANCE",
  "-65456cc2": "We do more than vehicles!  We also offers managed site services & programme maintenance for your office, building, petrol station, or other commercial property.",
  "5dd17d47": "We wash buildings, scrub pavement, offer water blasting, and sort out your rubbish.",
  "3bd0a1ce": "Car Flooded?",
  "-420fce61": "No worries! ",
  "-41f14d0f": "We'll make it just like new. Check out our full flood-cleaning service.",
  "39a07532": "Can we clean it? Yes we can.",
  "-52bd880f": "Learn More",
  "1a4297e9": "Information We Collect and How We Use It",
  "a872afb": "We offer a number of services that do not require you to register for an account or provide any personal information to us. In order to provide our full range of services, we may collect the following types of information:",
  "-5237b974": "Information you provide",
  "-21550a2b": "When you sign up for an Account or other service or promotion that requires registration, we ask you for personal information (such as your name, email address and an account password). For certain services, we may also request credit card or other payment account information which we maintain in encrypted form on secure servers. We may combine the information you submit under your account with information from other services or third parties in order to provide you with a better experience and to improve the quality of our services. For certain services, we may give you the opportunity to opt out of combining such information.",
  "-64062591": "Cookies",
  "322e49ec": "When you visit our site, we send one or more cookies – a small file containing a string of characters – to your computer or other device that uniquely identifies your browser. We use cookies to improve the quality of our service, including for storing user preferences and tracking user trends. We may set one or more cookies in your browser when you visit a website.",
  "-16f49d0": "Log information",
  "-d41bd1b": "When you access our services, our servers automatically record information that your browser sends whenever you visit a website. These server logs may include information such as your web request, Internet Protocol address, browser type, browser language, the date and time of your request and one or more cookies that may uniquely identify your browser.",
  "-606f1fce": "User communications",
  "-5b55573": "When you send email or other communications to us, we may retain those communications in order to process your inquiries, respond to your requests and improve our services.",
  "-46b1fc2c": "Affiliated Services on other sites",
  "6987f0ce": "We offer some of our services on or through other web sites. Personal information that you provide to those sites may be sent to us in order to deliver the service. We process such information under this Privacy Policy. The affiliated sites through which our services are offered may have different privacy practices and we encourage you to read their privacy policies.",
  "4605f99": "Links",
  "13fa9d6": "We may present links in a format that enables us to keep track of whether these links have been followed. We use this information to improve the quality and organization of our content.",
  "53ad6bd3": "We only process personal information for the purposes described in this Privacy Policy and/or the supplementary privacy notices for specific services. In addition to the above, such purposes include:",
  "78ccd54d": "Providing our services, including the display of customized content and advertising;",
  "-44d874a1": "Auditing, research and analysis in order to maintain, protect and improve our services;",
  "3fa943bd": "Ensuring the technical functioning of our network;",
  "-6ffca653": "Protecting our rights or property, or that of our users; and",
  "-4c665b4b": "Developing new services.",
  "3c884eb3": "VISIT OUR FULL WEBSITE",
  "66d97a77": "We Clean",
  "7877d7b8": "Click ",
  "-5f94bb4e": "any vehicle category to learn more.",
  "789b6526": "Full valet service, at your home or office, at a time that works best for you.",
  "-14085076": "The only mobile truck was in New Zealand!",
  "-6f636e9": "Full sanitization, and special cleaning services.",
  "16b4e2e5": "Whoops! 404",
  "49a057c4": "Page not found",
  "-267378ff": "This page may have been moved.",
  "-64032785": "Visit home page",
  "-33c8e0c8": "See all of our client testimonials",
  "-7ceae8eb": "  Humans have accidents, we sort it out. ",
  "27b6a914": "Learn more about our services",
  "3ad8ae2d": "We do more than vehicles!  We also offer managed site services & programme maintenance for your office, building, petrol station, or other commercial property.",
  "2c8adca5": "ABOUT OUR SERVICES",
  "-21452884": "Our top priority is to provide our customers with a world-class service. All of our staff have extensive training and experience, to ensure the highest quality of service delivery.",
  "3436d3bc": "Here is how we are different-",
  "-71ea4bda": "We are entirely mobile",
  "259b8764": ".  All of our services are mobile so that we can clean your vehicles at the location most convenient for you.  For corporate car fleets, and commercial truck fleets, this means minimum downtime for your drivers, and no wasted wages.  For personal vehicles, it means unmatched convenience, and the ability have your car cleaned easily at your home or work. ",
  "-1e7af504": "Our hours are flexible",
  "-6b9823ec": ".  We can come to you at any time of the day or night, on weekdays or weekends.",
  "-1f1490f4": "Regular servicing options",
  "76d47fe0": ".  If you desire, we can provide regularly scheduled washing to ensure that your vehicles and corporate fleet present the best representation of you and your company.",
  "1940bab4": "Full service valet",
  "3aba3dbe": ".  Our valet services include a full interior and exterior clean; carpet wash and upholstery shampoo; alloy and chrome polishing; dressage of all vinyl surface; and hoodlining. After that kind of detailing, pride in your fleet is just a give-in.",
  "4ae504a7": "Specialized sanitisation services",
  "5f490a55": ".  We provide specialised cleaning for food grade vehicles such as milk trucks.",
  "28e90dc0": "Environmentally friendly",
  "22f9562": ".  Protecting New Zealand's environment is important to us. That is why we bring everything we need from power to water and shelter; PLUS take everything away again, including the water! (We are proud to be one of the few approved waste water removal approved operators nationally.)",
  "49802f0b": "Flexible pricing for fleets",
  "-6e173808": ".  All pricing is negotiable based on the frequency of washes for the number of vehicles provided.",
  "200d": "‍",
  "-11c6301f": "Protected page",
  "-f5c4b5f": "Incorrect password. Please try again.",
  "3571e53d": "We come to you!",
  "42ce499": "The Car Cleaning Company covers the entire Auckland region with our fleet of specialised vans.",
  "1f8c9758": "We provide both personal residential cleans at your home or office, and we do full commercial fleets as well. ",
  "31c91803": "Call us anytime for a free quote. Our pricing is based on the size of your fleet, and the frequency of washing you require.",
  "52f6285f": "info@carcleaning.nz",
  "-729ea5ad": "freephone 0800 447 666",
  "-15bd865e": "phone 09 527 7730\n          ",
  "2f6b5fd4": "Monday to Friday",
  "-47b70d8": "8:30am - 4:30pm",
  "7d5ca56c": "How can we Help?",
  "437fe647": "Oops! Something went wrong while submitting the form :(",
  "645f0031": "About us",
  "-6181698d": "The Truck Cleaning Company provides a full range of professional cleaning services for your private vehicles and corporate fleets.",
  "-70d4fbcf": "ABOUT US",
  "-2790f89c": "We come to you",
  "1c853fab": " and wash your vehicles on-site, with",
  "-1812f63d": "the full valet experience - there’s no need to waste time and money sending your workers out. Simply tell us when you want us there and we’ll come to you for total convenience. ",
  "-611dffdb": "Every member of our staff has extensive training and experience, and we pride ourselves on being able to provide the best quality service. We’ll do whatever it takes to ensure that you’re thrilled with the service our team provides.",
  "-7e3fda83": "WE COME TO YOU!",
  "29ac4359": "We have four specialised divisions-",
  "-5535f84f": "The Car Cleaning Company",
  "-6ae05a6b": "The Heavy Transport Cleaning Company",
  "-60986b79": "The Boat Cleaning Company",
  "-62374a6c": "PERSONAL VALET & GROOMING SERVICES",
  "-554eaaf4": "We can wash your personal vehicles at your home, or work, whether or not you are available to be there.  Simply schedule with us",
  "104b6e3b": "We also offer a full range of services for personal trucks, boats, farming equipment, and more.",
  "67996ecd": "CORPORATE FLEET GROOMING",
  "3c06f19c": "Our expert team is well prepared to handle your fleet of corporate cars, taxis, or commercial trucks.  We work around your schedule, and we perform all cleaning at the location of your choosing.",
  "7157d6a6": "THE TRUCK CLEANING COMPANY",
  "-472f6dec": "Our reputation is built on providing the best service and valet clean for truck fleets. We’re New Zealand’s only mobile cleaning service for trucks, and all of our products are environmentally friendly.",
  "5b2e3674": "We give your trucks the full valet experience from wherever you are - there’s no need to waste time and money sending your workers out. Simply tell us when you want us there and we’ll come to you for total convenience.  ",
  "4ef36e30": "HEAVY TRANSPORT GROOMING",
  "-6387f960": "We have specialised equipment for cleaning the heaviest of vehicles, including aircraft, boats, and trains.  We even do farming and mining equipment, to a very high degree of quality.",
  "-4776f972": "Why People Choose Us",
  "1b66e1d7": "Convenience",
  "-724b9cc": " – Our fully mobile valet and services make keeping your personal vehicles and corporate fleets in tip top shape.",
  "-75f6a721": "Quality",
  "-d0d2c4d": " – We wash by hand to ensure that every last millimetre gets thoroughly cleaned. Anything less isn’t good enough for you, and wouldn’t be good enough for us either.",
  "-4028fe7b": "Innovation",
  "9d0bfc0": " - We keep up to date with all the latest technology, products and techniques so that we can get the job done much more efficiently and thoroughly than anyone else.",
  "71b8358a": "Experience",
  "-49c55c01": " - All of our employees are fully trained in every aspect of transportation cleaning and come with years of experience.",
  "55b4fcf9": "Flexibility",
  "-44799364": " - Our scheduling is flexible. We come to you, and work around your personal and corporate schedules.",
  "-495de5d2": "Responsibility",
  "-1e9e2f50": " - Our company meets all of New Zealand's wastewater disposal regulations.",
  "188cd7c1": "Friendly service!",
  "-44ae263b": "Can we clean it? ",
  "afac17": "Yes we can.",
  "-4f18c728": "Email us your CV now",
  "d630df": " if you would like to apply.\n            ",
  "2a344c9f": "JOB DETAILS",
  "7e85e19e": "Search results",
  "-6ca0ae38": "Search",
  "-75764c4": "No matching results.",
  "1c620617": "Corporate fleet car valet",
  "-3fac26e6": "Full corporate fleet valet, when & where you need us.",
  "-6992da36": "ASG's fleet of professional cleaners is available to manage all of your car fleet cleaning needs. ",
  "35b49498": "No matter what industry you're in, ",
  "-33eda389": "Executive cars",
  "-530b3473": "Healthcare",
  "34ef8014": "Delivery",
  "4cd9df5": "Taxis",
  "5755e014": "Hospitality",
  "-17a2e9dc": "Contact us to discuss your needs and we'll organise a proposal for you. ",
  "6a26451a": "13D Andromeda Crescent",
  "-7019589e": "East Tamaki",
  "1335f1b9": "Auckland 2013",
  "-3de9144b": "bookings@tccc.co.nz",
  "26bf5639": "phone (09) 527 7730",
  "-3f84203c": "freephone (0800) 447 666",
  "5375da3": "Mon-Fri 8:00am - 5:00pm",
  "-75952c2": "Welcome to our website. If you continue to browse and use this website you are agreeing to comply with and be bound by the following terms and conditions of use, which together with our privacy policy govern our relationship with you in relation to this website.",
  "22bfd6e4": "The use of this website is subject to the following terms of use:",
  "68a90daa": "The content of the pages of this website is for your general information and use only. It is subject to change without notice. ",
  "-4bda0964": "Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. ",
  "-39a4900": "You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. ",
  "-69445223": "Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. ",
  "-56f305e6": "This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these terms and conditions. ",
  "-2dedb8ea": "All trade marks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. ",
  "-43b3926c": "Unauthorised use of this website may give rise to a claim for damages and/or be a criminal offence. ",
  "-476c2550": "From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). ",
  "-58729b83": "Your use of this website and any dispute arising out of such use of the website is subject to the laws of New Zealand.",
  "-6ca69ef0": "COVID-19 & FLU MEDICAL-GRADE SANITISE",
  "3e295277": "We offer full Medical-Grade Sanitisation for ",
  "19e018f0": "COVID-19",
  "-52b9bc39": ", for your buildings, homes, and vehicles",
  "-5f7f31b9": "The pandemic is past, but COVID is still a problem in many communities. We're still cracking down hard with our medical-grade disinfectant.",
  "7c4d7b17": "Need to sanitise your building or vehicle? We can clean anything...",
  "42ab754": "Homes",
  "-7183b3f5": "Cars, Trucks, Buses and more",
  "-61390b8e": "Restaurants & Cafes",
  "292faffb": "Office buildings",
  "-2a7d54a1": "Schools",
  "221a38": "Gyms",
  "-48924010": "and more.",
  "-1cbe4cf5": "We'll handle all aspects, including all hard surfaces- where COVID-19 likes to live for extended periods. We also clean drapes and carpets, and more.",
  "56f665c5": "Contact us for details.",
  "739212ad": "We have three specialised divisions-",
  "-3557ff13": "Our reputation is built on providing the best service and valet clean for truck fleets. We’re New Zealand’s only mobile cleaning service for trucks, all of our products are environmentally friendly, and we provide food-grade sanitisation for some of the biggest names in the industry.",
  "-46b32d67": "We give your trucks the full valet experience from wherever you are - there’s no need to waste time and money sending your workers out. Simply tell us when you want us there and we’ll come to you for total convenience.  Every member of our staff has extensive training and experience, and we pride ourselves on being able to provide the best quality service. We’ll do whatever it takes to ensure that you’re thrilled with the service our team provides.",
  "336027e7": "Call (09) 257 3172 for a quote now.",
  "-7bc27f6b": "Careers",
  "7f6114ac": "Build a Fantastic Career with Us",
  "-e4fd4fa": "We arealways looking for reliable people to join our mobile valet team.  ",
  "12f2998d": "We offer a great working environment and the opportunity to build a ",
  "7c420b69": "professional career ",
  "-32b8ab03": "as a transportation cleaning specialist.",
  "-799f6869": "If you are interested in a career with ASG, please email your CV and work experience to us",
  "-24642205": "CURRENT JOB POSTINGS",
  "-438a02d3": "Click any posting for details.",
  "-155703cf": ">> Learn more",
  "-4d10d830": "If you are interested in a career with us, please email your CV and work experience to us at-"
}